Revit 2027 API
EnergyDataSettings.BuildingOperatingSchedule Property
Note: This API is now obsolete.
 The operating schedule of the building used for conceptual model energy calculations.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public gbXMLBuildingOperatingSchedule BuildingOperatingSchedule { get; set; }
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Property BuildingOperatingSchedule As gbXMLBuildingOperatingSchedule
	Get
	Set
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
property gbXMLBuildingOperatingSchedule BuildingOperatingSchedule {
	gbXMLBuildingOperatingSchedule get ();
	void set (gbXMLBuildingOperatingSchedule value);
}
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
member BuildingOperatingSchedule : gbXMLBuildingOperatingSchedule with get, set
Property Value
gbXMLBuildingOperatingSchedule
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The building operating schedule does not fall within an appropriate range.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace